In [1]:
from pandas import Series, DataFrame

In [2]:
import pandas as pd

In [4]:
#A Series is a one-dimensional array-like object containing an array of data (of any NumPy data type) and an associated array of data labels, called its index
obj=Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
#Create a Series with an index identifying each data point
obj2=Series([4,7,-5,3], index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
obj2['a']

-5

In [12]:
obj2['d']=6

In [13]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [14]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [15]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [16]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [18]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [19]:
'b' in obj2

True

In [20]:
'e' in obj2

False

In [21]:
#Should you have data contained in a Python dict, you can create a Series from it by passing the dict:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

In [22]:
obj3=Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
states=['California','Ohio','Oregon','Texas']

In [25]:
obj4=Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [28]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
#A critical Series feature for many applications is that it automatically aligns differently- indexed data in arithmetic operations:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [32]:
#Both the Series object itself and its index have a name attribute, which integrates with other key areas of pandas functionality
obj4.name='population'

In [33]:
obj4.index.name='state'

In [34]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [36]:
#A Seriesâ€™s index can be altered in place by assignment
obj.index=['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

DataFrame

In [40]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
     'year':[2000,2001,2002,2001,2002],
     'pop':[1.5,1.7,3.6,2.4,2.9]}
frame=DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
#Specify a sequence of columns
DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [42]:
frame2=DataFrame(data, columns=['year','state','pop','debt'], index=['one','two','three','four','five'])

In [43]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [44]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [45]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [46]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [47]:
frame2.ix['three']

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [48]:
frame2['debt']=16.5

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [51]:
frame2['debt']=np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [52]:
val=Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [54]:
frame2['debt']=val

In [55]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [57]:
frame2['eastern']=frame2.state=='Ohio'

In [58]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [59]:
del frame2['eastern']

In [60]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [61]:
pop={'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [62]:
frame3=DataFrame(pop)

In [63]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [64]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [66]:
pdata={'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}

In [67]:
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [69]:
frame3.index.name='year'

In [70]:
frame3.columns.name='state'

In [71]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [72]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [73]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [74]:
obj=Series(range(3), index=['a','b','c'])

In [75]:
index=obj.index

In [76]:
index#Index objects are immutable and thus can't be modified by the user

Index(['a', 'b', 'c'], dtype='object')

In [77]:
index[1:]

Index(['b', 'c'], dtype='object')

In [79]:
index=pd.Index(np.arange(3))

In [80]:
obj2=Series([1.5,-2.5,0],index=index)

In [81]:
obj2.index is index

True

In [82]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [83]:
'Ohio' in frame3.columns

True

In [84]:
2003 in frame3.index

False

Reindexing

In [85]:
obj=Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [86]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [87]:
obj2=obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [88]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [89]:
obj3=Series(['blue','purple','yellow'], index=[0,2,4])

In [90]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [91]:
frame=DataFrame(np.arange(9).reshape(3,3), index=['a','c','d'], columns=['Ohio','Texas','California'])

In [92]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [94]:
frame2=frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [95]:
states=['Texas','Utah','Californoia']

In [96]:
frame.reindex(columns=states)

   Texas  Utah  Californoia
a      1   NaN          NaN
c      4   NaN          NaN
d      7   NaN          NaN

Dropping entires from an axis

In [101]:
obj=Series(np.arange(5.), index=['a','b','c','d','e'])

In [102]:
new_obj=obj.drop('c')

In [103]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [104]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [105]:
data=DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','Colorado','Utah','New York'], columns=['one','two','three','four'])

In [106]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [108]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

Indexing, selection and filtering

In [110]:
obj=Series(np.arange(4.),index=['a','b','c','d'])

In [111]:
obj['b']

1.0

In [112]:
obj[1]

1.0

In [113]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [114]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [115]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [116]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [117]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [118]:
obj['b':'c']=5

In [119]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [120]:
data=DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'], columns=['one','two','three','four'])

In [121]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [122]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [123]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [124]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [125]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [126]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [127]:
data[data<5]=0

In [128]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [129]:
data.ix['Colorado',['two','three']]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int64

In [130]:
data.ix[['Colorado','Utah'],[3,0,1]]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [131]:
data.ix[2]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [132]:
data.ix[:'Utah','two']

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

Arithmetic and data alignment

In [4]:
s1=Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [6]:
s2=Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [7]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [8]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [9]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [11]:
import numpy as np
df1=DataFrame(np.arange(9.).reshape(3,3),columns=list('bcd'),index=['Ohio','Texas','Colorado'])

In [13]:
df2=DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Orange'])

In [15]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [16]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Orange  9.0  10.0  11.0

In [17]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Orange    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [18]:
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Orange    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [19]:
df1.reindex(columns=df2.columns, fill_value=0)

            b    d  e
Ohio      0.0  2.0  0
Texas     3.0  5.0  0
Colorado  6.0  8.0  0

Operation between DataFrame and Series

In [22]:
arr=np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [23]:
arr[0]

array([0., 1., 2., 3.])

In [24]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [25]:
frame=DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [26]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [27]:
series=frame.ix[0]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [28]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [29]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [30]:
series2=Series(range(3),index=['b','e','f'])

In [31]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [32]:
series3=frame['d']

In [33]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [34]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [35]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

Function application and mapping

In [37]:
frame=DataFrame(np.random.randn(4,3), columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [38]:
frame

               b         d         e
Utah   -0.234678 -0.639331  0.309791
Ohio    0.363071  0.217026  0.656211
Texas  -2.397388 -0.252201  0.269592
Oregon  0.206673 -1.165986 -1.306294

In [39]:
np.abs(frame)

               b         d         e
Utah    0.234678  0.639331  0.309791
Ohio    0.363071  0.217026  0.656211
Texas   2.397388  0.252201  0.269592
Oregon  0.206673  1.165986  1.306294

In [40]:
f=lambda x:x.max()-x.min()

In [41]:
frame.apply(f)

b    2.760459
d    1.383012
e    1.962505
dtype: float64

In [42]:
frame.apply(f, axis=1)

Utah      0.949122
Ohio      0.439185
Texas     2.666980
Oregon    1.512967
dtype: float64

In [47]:
def f(x):
    return Series([x.min(), x.max()], index=['min','max'])

In [48]:
frame.apply(f)

            b         d         e
min -2.397388 -1.165986 -1.306294
max  0.363071  0.217026  0.656211

In [49]:
format=lambda x: '%.2f' % x

In [50]:
frame.applymap(format)

            b      d      e
Utah    -0.23  -0.64   0.31
Ohio     0.36   0.22   0.66
Texas   -2.40  -0.25   0.27
Oregon   0.21  -1.17  -1.31

In [52]:
frame['e'].map(format)

Utah       0.31
Ohio       0.66
Texas      0.27
Oregon    -1.31
Name: e, dtype: object

Sorting and Ranking

In [54]:
obj=Series(range(4),index=['d','a','b','c'])

In [55]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [56]:
frame=DataFrame(np.arange(8).reshape((2,4)), index=['three','one'],columns=['d','a','b','c'])

In [57]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [58]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [59]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [60]:
obj=Series([4,7,-3,2])

In [63]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [64]:
obj=Series([4,np.nan,7,np.nan,-3,2])

In [66]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [67]:
frame=DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [68]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [69]:
frame.sort_index(by='b')

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [70]:
frame.sort_index(by=['a','b'])

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [71]:
obj=Series([7,-5,7,4,2,0,4])

In [72]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [73]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [74]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [75]:
frame=DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [76]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [77]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

Axis indexes with duplicate values

In [79]:
obj=Series(range(5),index=['a','a','b','b','c'])

In [80]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [81]:
obj.index.is_unique

False

In [82]:
obj['a']

a    0
a    1
dtype: int64

In [83]:
obj['c']

4

In [84]:
df=DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [85]:
df

          0         1         2
a -1.827143 -0.936907  0.151733
a  0.639890  0.518151 -0.714101
b -0.110303  1.412226  0.754714
b -1.252662 -0.254296 -0.578188

In [86]:
df.ix['b']

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
b -0.110303  1.412226  0.754714
b -1.252662 -0.254296 -0.578188

Summarizing and Computing Descriptive Statistics

In [88]:
df=DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])

In [89]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [90]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [91]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [92]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [93]:
#Return indirect statistics like the index value where the minimum or maximum values are attained
df.idxmax()

one    b
two    d
dtype: object

In [94]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [95]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [96]:
obj=Series(['a','a','b','c']*4)

In [97]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Unique Values, Value Counts, and Membership

In [104]:
obj=Series(['c','a','d','a','a','b','b','c','c'])

In [105]:
uniques=obj.unique()

In [106]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [107]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [108]:
pd.value_counts(obj.values, sort=False)

c    3
b    2
d    1
a    3
dtype: int64

In [109]:
mask=obj.isin(['b','c'])

In [110]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [111]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [112]:
data=DataFrame({'Qu1':[1,3,4,3,4],
               'Qu2':[2,3,1,2,3],
               'Qu3':[1,5,2,4,4]})

In [113]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [114]:
result=data.apply(pd.value_counts).fillna(0)

In [115]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

Handle Missing Data

In [117]:
string_data=Series(['aardvark','artichoke',np.nan,'avocado'])

In [118]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [119]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [120]:
string_data[0]=None

In [121]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

Filtering Out Missing Data

In [123]:
from numpy import nan as NA

In [124]:
data=Series([1,NA,3.5,NA,7])

In [125]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [126]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [127]:
data=DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [128]:
cleaned=data.dropna()

In [129]:
#Dop rows that are all NA
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [130]:
data[4]=NA

In [131]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [132]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [133]:
df=DataFrame(np.random.randn(7,3))

In [134]:
df.ix[:4,1]=NA

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [135]:
df.ix[:2,2]=NA

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [136]:
df

          0         1         2
0  0.511345       NaN       NaN
1 -0.218220       NaN       NaN
2 -0.177317       NaN       NaN
3  0.012685       NaN  1.614228
4  0.639670       NaN -1.974726
5 -0.060627 -0.686517  0.662946
6 -1.258305  0.494145 -1.949862

In [137]:
df.dropna(thresh=3)

          0         1         2
5 -0.060627 -0.686517  0.662946
6 -1.258305  0.494145 -1.949862

Filling in Missing Data

In [139]:
df.fillna(0)

          0         1         2
0  0.511345  0.000000  0.000000
1 -0.218220  0.000000  0.000000
2 -0.177317  0.000000  0.000000
3  0.012685  0.000000  1.614228
4  0.639670  0.000000 -1.974726
5 -0.060627 -0.686517  0.662946
6 -1.258305  0.494145 -1.949862

In [140]:
df.fillna({1:0.5,3:-1})

          0         1         2
0  0.511345  0.500000       NaN
1 -0.218220  0.500000       NaN
2 -0.177317  0.500000       NaN
3  0.012685  0.500000  1.614228
4  0.639670  0.500000 -1.974726
5 -0.060627 -0.686517  0.662946
6 -1.258305  0.494145 -1.949862

In [141]:
_=df.fillna(0,inplace=True)

In [142]:
df

          0         1         2
0  0.511345  0.000000  0.000000
1 -0.218220  0.000000  0.000000
2 -0.177317  0.000000  0.000000
3  0.012685  0.000000  1.614228
4  0.639670  0.000000 -1.974726
5 -0.060627 -0.686517  0.662946
6 -1.258305  0.494145 -1.949862

In [143]:
df=DataFrame(np.random.randn(6,3))

In [144]:
df.ix[2:,1]=NA

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [145]:
df.ix[4:,2]=NA

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [146]:
df

          0         1         2
0 -0.627479  0.135143 -1.305313
1 -0.689802  0.959817 -1.454625
2 -0.644953       NaN  1.762567
3 -0.024318       NaN  1.020029
4  1.803443       NaN       NaN
5 -1.485171       NaN       NaN

In [147]:
df.fillna(method='ffill')

          0         1         2
0 -0.627479  0.135143 -1.305313
1 -0.689802  0.959817 -1.454625
2 -0.644953  0.959817  1.762567
3 -0.024318  0.959817  1.020029
4  1.803443  0.959817  1.020029
5 -1.485171  0.959817  1.020029

In [148]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.627479  0.135143 -1.305313
1 -0.689802  0.959817 -1.454625
2 -0.644953  0.959817  1.762567
3 -0.024318  0.959817  1.020029
4  1.803443       NaN  1.020029
5 -1.485171       NaN  1.020029

In [149]:
data=Series([1., NA, 3.5, NA,7])

In [150]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Hierarchical Indexing

In [153]:
data=Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])

In [154]:
data

a  1    0.024178
   2    2.193045
   3   -2.563284
b  1   -1.253596
   2   -0.272561
   3    0.134985
c  1    0.130935
   2   -1.305144
d  2    0.459721
   3    1.116019
dtype: float64

In [155]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [156]:
data['b']

1   -1.253596
2   -0.272561
3    0.134985
dtype: float64

In [157]:
data['b':'c']

b  1   -1.253596
   2   -0.272561
   3    0.134985
c  1    0.130935
   2   -1.305144
dtype: float64

In [158]:
data.ix[['b','d']]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1   -1.253596
   2   -0.272561
   3    0.134985
d  2    0.459721
   3    1.116019
dtype: float64

In [159]:
data[:,2]

a    2.193045
b   -0.272561
c   -1.305144
d    0.459721
dtype: float64

In [160]:
data.unstack()

          1         2         3
a  0.024178  2.193045 -2.563284
b -1.253596 -0.272561  0.134985
c  0.130935 -1.305144       NaN
d       NaN  0.459721  1.116019

In [161]:
data.unstack().stack()

a  1    0.024178
   2    2.193045
   3   -2.563284
b  1   -1.253596
   2   -0.272561
   3    0.134985
c  1    0.130935
   2   -1.305144
d  2    0.459721
   3    1.116019
dtype: float64

In [164]:
frame=DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1,2,1,2]], columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [165]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [166]:
frame.index.names=['key1','key2']

In [167]:
frame.columns.names=['state','color']

In [168]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [169]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

Reordering and Sorting Levels

In [171]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [172]:
frame.sortlevel(1)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [173]:
frame.swaplevel(0,1).sortlevel(0)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

Summary Statistics by Level

In [175]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [176]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

Using a DataFrame's Columns

In [179]:
frame=DataFrame({'a':range(7),'b':range(7,0,-1),
                'c':['one','one','one','two','two','two','two'],
                'd':[0,1,2,0,1,2,3]})

In [180]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [181]:
frame2=frame.set_index(['c','d'])

In [182]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [183]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [184]:
frame.reset_index()

   index  a  b    c  d
0      0  0  7  one  0
1      1  1  6  one  1
2      2  2  5  one  2
3      3  3  4  two  0
4      4  4  3  two  1
5      5  5  2  two  2
6      6  6  1  two  3

Integer Indexing

In [186]:
ser=Series(np.arange(3.))

In [188]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [189]:
ser2=Series(np.arange(3.),index=['a','b','c'])

In [190]:
ser2[-1]

2.0

In [191]:
ser.ix[:1]

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    0.0
1    1.0
dtype: float64

In [192]:
ser3=Series(range(3),index=[-5,1,3])

In [194]:
frame=DataFrame(np.arange(6).reshape(3,2),index=[2,0,1])

In [196]:
frame

   0  1
2  0  1
0  2  3
1  4  5